# SetCLOpacityN

```pascal
PROCEDURE SetCLOpacityN(
				className   : STRING;
				penOpacity  : INTEGER;
				fillOpacity : INTEGER);
```

```python
def vs.SetCLOpacityN(className, penOpacity, fillOpacity):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|   |
|penOpacity|INTEGER|   |
|fillOpacity|INTEGER|   |

## Version
Availability: from Vectorworks 2017

## Category
* Classes